# Дан список чисел. Определите, сколько в нем встречается различных чисел.

# Input: [1, 1, 2, 0, -1, 3, 4, 4]

# Output: 6
# list_ = [1, 1, 2, 0, -1, 3, 4, 4]
# list_ = len(set(list_))
# print(list_)
# ======================================================================
# Дана последовательность из N целых чисел и число K. Необходимо сдвинуть всю последовательность (сдвиг - циклический) на K элементов вправо,  K – положительное число.

# Input:   [1, 2, 3, 4, 5] k = 3

# Output:  [4, 5, 1, 2, 3]

list_ = [1, 2, 3, 4, 5]
k = 3
# list_1 = list_[:k]
# list_2 = list_[k:]
# list_2.extend(list_1)
# print(list_2)




# 1.Создайте список из случайных чисел. 
# Найдите номер его последнего локального максимума 
# (локальный максимум — это элемент, который больше любого из своих соседей).


# import random
# list_ = [random.randint(0,10) for i in range(10)]
# print(list_)

# index = 0
# for i in range(len(list_)-1):
#     if list_[i-1] < list_[i] > list_[i+1]:
#         index = i
# print(index)

# 3.Создайте список из случайных чисел. Найдите второй максимум.
# import random
# list_ = [random.randint(0,10) for i in range(10)]
# print(list_)
# index = 0
# for i in range(len(list_)-1):
#     if list_[i-1] < list_[i] > list_[i+1]:
#         index = i
# print(max)

# a = [1, 2, 3] # Первый максимум == 3, второй == 2

# =================================================
# Напишите программу для печати всех уникальных значений в словаре. 

# Input:  [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}] 

# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}


# lst = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": "S005"}, {" V ":"S009"}, {" VIII ":"S007"}] 
# res = [0]*len(lst)
# temp = []

# for i in range(len(lst)):
#     res[i] = list(lst[i].values())

# for i in range(len(res)):
#     if res[i] not in temp:
#         temp.append(res[i])

# print(temp)
# =================================================
# Дан массив, состоящий из целых чисел. Напишите программу, 
# которая подсчитает количество элементов массива, 
# больших предыдущего (элемента с предыдущим номером) 
# Input: [0, -1, 5, 2, 3]
# Output: 2 
# Пояснение: (-1 < 5, 2 < 3)

import random
list_ = [random.randint(0,10) for i in range(5)]
count = 0
print(list_)
for i in range(len(list_)-1):
    if list_[i+1] > list_[i]:
        count += 1

print(count)